#88p ~ 90p
print("--------------------------------------------------")
print("심화문제 3.1")
a = 2
n = 2
for i in range(5):
    print(a, "         ", n, "         ", a ** n)
    a += 1
print("--------------------------------------------------")
print("")
print("")
print("")
#66p ~ 67p
print("--------------------------------------------------")
print("심화문제 3.2")
x = 2
for i in range(9):
    print(x, "의 제곱근 = ", x ** 0.5)
    x += 1
print("--------------------------------------------------")
print("")
print("")
print("")
#66p ~ 67p
print("--------------------------------------------------")
print("심화문제 3.3")
c = 0
for i in range(10):
    b = 2 << c
    print(b, end=' ')
    c += 1
print("")
print("--------------------------------------------------")
print("")
print("")
print("")
print("--------------------------------------------------")
print("심화문제 3.4")
tf = 0
q = int(input("정수를 입력하세요 : "))
if q % 2 == 0 :
    if q >= 0 and q <= 100 :
        tf = "True"
    else:
        tf = "False"
else:
    tf = "False"

print("입력된 정수는 0에서 100의 범위 안에 잇는 짝수인가요?", tf)
print("--------------------------------------------------")
print("")
print("")
print("")